SET NAMES UTF8;
DROP DATABASE IF EXISTS foodmask;
CREATE DATABASE foodmask CHARSET=UTF8;
USE foodmask;
/**创建用户信息表**/
CREATE TABLE `user` (
  `uid` int(11) NOT NULL,
  `uname` varchar(32) DEFAULT NULL,
  `upwd` varchar(32) DEFAULT NULL,
  `phone` varchar(16) DEFAULT NULL,
  `avatar` varchar(64) DEFAULT NULL,
  `email` varchar(64) DEFAULT NULL,
  `mysign` varchar(64) DEFAULT NULL,
  `gender` int(11) DEFAULT NULL,	        #性别  0-女  1-男
  `lucysign` int(11) DEFAULT NULL,      	#签到次数
  `signtag` int(11) DEFAULT NULL,		#签到,1已签#签到状态,0未到
  `signtime` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO `user` (`uid`, `uname`, `upwd`, `phone`, `avatar`, `email`, `mysign`, `gender`, `lucysign`, `signtag`, `signtime`) VALUES
(1, 'Mike', 'm123456', '1579051192', 'img/user/n2.jpg', '', '', 1, 1, 0, 1508857590478),
(2, 'Mary', '123456', '15770591192', 'img/user/n2.jpg', '', '', 0, 1, 0, 0),
(3, 'linda', 'l123456', '15740591192', 'img/user/n2.jpg', '', '', 0, 1, 0, 0);

/**创建首页信息轮播图**/
CREATE TABLE index_carousel(
 cid INT PRIMARY KEY AUTO_INCREMENT,
 img VARCHAR(128),
 title VARCHAR(128),
 href VARCHAR(128)
);
INSERT INTO index_carousel VALUES
(NULL,'img/index/banner1.jpg','秋天总有一份对桂花的执念','foodsubject.html/guihuadezuofa'),
(NULL,'img/index/banner2.jpg','“素食”甜,迎接最美秋天','foodsubject.html/qiujisushitianpin'),
(NULL,'img/index/banner3.jpg','秋季补水护肤,想美趁早_秋季补水护肤_秋季如何护肤补水','foodsubject.html/qiujibushui'),
(NULL,'img/index/banner4.jpg','秋风响,蟹脚痒','foodsubject.html/dazhaxiezuofadaquan'),
(NULL,'img/index/banner5.jpg','撒椒','foodsubject.html/sajiao'),
(NULL,'img/index/banner6.jpg','地下果:长在地下的精灵们','foodsubject.html/dixiaguo');


/**用户的收货信息**/
CREATE TABLE fd_receiver_address(
  aid INT PRIMARY KEY AUTO_INCREMENT,
  user_id INT,                #用户编号
  receiver VARCHAR(16),       #接收人姓名
  province VARCHAR(16),       #省
  city VARCHAR(16),           #市
  county VARCHAR(16),         #县
  address VARCHAR(128),       #详细地址
  cellphone VARCHAR(16),      #手机
  postcode CHAR(6)	      #邮编
);
/**菜谱表单制作**/
CREATE TABLE `food_menu` (
  `mid` INT PRIMARY KEY AUTO_INCREMENT,
  `user_id` int(11) DEFAULT NULL,
  `subject` varchar(32) DEFAULT NULL,
  `mainimg` varchar(128) DEFAULT NULL,
  `img` varchar(128) DEFAULT NULL,
  `message` varchar(128) DEFAULT NULL,
  `level` VARCHAR(11) DEFAULT NULL,
  `cuisine` VARCHAR(11) DEFAULT NULL,
  `technics` VARCHAR(11) DEFAULT NULL,
  `during` VARCHAR(11) DEFAULT NULL,
  `cookers` VARCHAR(64) DEFAULT NULL,
  `food1` varchar(64) DEFAULT NULL,
  `food2` varchar(64) DEFAULT NULL,
  `food3` varchar(64) DEFAULT NULL,
  `food4` varchar(64) DEFAULT NULL,
  `note` varchar(800) DEFAULT NULL,
  `tips` varchar(128) DEFAULT NULL,
  `copyright` int(11) DEFAULT NULL,
  `fenlei` varchar(32) DEFAULT NULL,
  `status` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

/**食材库建立**/
CREATE TABLE `food_materials` (
  `mid` int(11) NOT NULL,
  `title` varchar(1000) DEFAULT NULL,
  `issort` varchar(32) DEFAULT NULL
);
INSERT INTO `food_materials` (`mid`, `title`, `issort`) VALUES
(1, '鸡蛋,鸭蛋,鹌鹑蛋,皮蛋,鹅蛋,鸽子蛋,蛋清,蛋黄,松花蛋,卤蛋,鸽蛋,蛋白,蛋液,咸蛋黄,鸡蛋干', 'danlei'),
(2, '猪肉,里脊,猪小排,猪大排,排骨,猪蹄,猪肚,五花肉,腊肉,牛肉,牛腩,牛排,羊肉,羊排,火腿,香肠,猪血,猪排,猪脚,猪肝,狗肉,猪腰,羊蝎子,子排,猪肘,猪肘子,血,猪心,猪小肠,猪尾巴,猪耳,猪皮,猪舌,猪骨头,熊掌,猪胰,羊腰子,羊血,羊心,蜗牛,羊蹄,羊脑,羊肺,羊腿肉,猪腿,龙骨,肋排,羊头,脊骨,后腿肉,大肠,棒骨,腔骨,培根,牛杂,牛心,牛尾,牛腿肉,牛蹄筋 ,牛蹄,牛舌,牛脑,牛里脊,牛筋,牛腱子,牛骨髓,牛骨,牛肝,牛肚, 牛鞭,牛百叶,驴肉,猪头肉,猪肺,猪大骨,猪蹄筋,羊肚,牛仔骨,田鸡,猪腱,猪后腿肉,脆骨,羊腩,肥牛,猪大肠,羊头肉,肉末,牛上脑,猪里脊,猪颈肉,猪肥肠,前臀尖,后臀尖,猪耳朵,猪脑,肉松,叉烧肉,午餐肉,熏肉,猪油,咸肉,羊前腿肉,羊后腿肉,羊里脊,羊腰子,羊眼,羊肝,羊骨,牛腱子肉,牛百叶,肉鸡,驴鞭,土鸡, 土番鸭, 脆皮肠,田鸡腿,马肉,马心,小里脊肉,牛肋骨,牛头皮,牛膝盖骨,牛肺,牛五花肉,牛肾,牛髓,牛大肠,牛血,牛外脊,牛小排,猪五花腩,野猪肉, 羊髓, 羊肩排,羊大肠, 羊舌,羊蹄筋, 羊臀,猪龙骨,猪胛心肉,猪颊肉, 猪天梯, 猪嘴边肉,肥膘肉,肥肉,方腿,黄牛肉,瘦肉, 腊肠, 肉馅,肉丸,黄喉,猪夹心肉, 风肉,牛板筋,猪筒骨, 兔腿,猪油渣, 猪前夹肉,羊尾,前腿肉', 'roulei'),
(3, '鸡肉,鸡翅,鸡腿,鸡爪,乌鸡,鸭肉,鸭肝,鸭子,野鸭,水鸭,鸡骨架,翅根,鸡脖,鸭脖,鸭架,老母鸡,鸭血,鸡胗,鸡胸肉,山鸡,翅尖,柴鸡,鸽子,鸡肾,鹌鹑,鸭心,鹅鸭,胸三,黄鸡,鸭翅,鸭掌,鸭腿,琵琶腿,鸭舌,鸡脆,骨鸡,杂鸡心,鸭胗,鸡肝,乳鸽,火鸡,整鸡,鹅肝,鸡中翅,全蛋液,咸鸡蛋,咸鸭蛋,咸鹅蛋,鸭头,鸭肠,鹅肉,鹅肝,仔鸡,鸡肫,北京填鸭,鸡皮,鸡屁股,白鸭,白鸭血,春鸡,乌鸡蛋,文昌鸡,麻雀蛋,鸭胰,鸭肫,宫廷鸡,童子鸡,毛肚', 'qinroulei'),
(4, '鹿肉,野味,野兔,蛇肉,兔肉,兔头,蜂蛹', 'yewei'),
(5, '草鱼,鲤鱼,鲫鱼,带鱼,黄鱼,鲈鱼,鳕鱼,墨鱼,鲅鱼,鲅鱼,金枪鱼,鲢鱼,青鱼,桂鱼,鲳鱼,鲶鱼,鳗鱼,三文鱼,黄花鱼,鱼翅,沙丁鱼,鲻鱼,鱼头,鱼泡,针鱼,橡皮鱼,鲮鱼,黄鳝,鲨鱼,三道鳞,黑鱼,柴鱼,鳊鱼,比目鱼,胖头鱼,泥鳅,鳎目鱼,银鱼,米鱼,乌头鱼,安康鱼,黄骨鱼,鲭鱼,凤尾鱼,白条鱼,罗非鱼,鮰鱼,丁香鱼,乌江鱼,三文鱼头,秋刀鱼,鱼皮,鲟鱼,多春鱼,鲮鲫鱼,多宝鱼,银鳕鱼,鱼籽,梭鱼,鱼尾,扒皮鱼,鲥鱼,鱼丸,鱼丸,鱼豆腐,蟹棒,丁香鱼,武昌鱼,鳙鱼,虹鳟鱼,沙尖鱼,鮸鱼,石斑鱼,虱目鱼,鲷鱼,龙利鱼,平鱼,金枪鱼罐头,鱼片,鱼干,鱼松,蟹柳,鱼子酱,木鱼花,肉魽鱼,软丝,白姑鱼,狮头鱼,蛇鲻,沙钻鱼,四破鱼,水晶鱼,白鱼,鳝鱼,板鱼,包公鱼,绿豆鱼,土虱鱼,鲃鱼,白鲳鱼,白带鱼,草鱼尾,柴鱼片,军曹鱼,鯷鱼,鳓鱼,塘鲺,柳叶鱼,太阳鱼,鲦鱼,乌鱼子,马哈鱼,吻仔鱼,乌仔鱼,吴郭鱼,香鱼,象鱼,明太鱼 ,木鱼干,尼罗红鱼,雪斑鱼,旗鱼,青鱼肝,青甘鱼,鲐鱼,鱼下巴,中国鲎,竹荚鱼,珍珠石斑,鱼胶粉,刁子鱼,感鱼,鲑鱼,狗母鱼,鲔鱼,黄颡鱼,黄鲂,红甘鱼,海鲫鱼,黄脚笠,红绸鱼,红衫鱼,鸦片鱼,虾潺,金鲳鱼,马鲛鱼', 'yulei'),
(6, '虾,虾肉,虾米,龙虾,虾仁,虾皮,白虾,基围虾,河虾,对虾,北极虾,海虾,皮皮虾,干虾仁,干虾,小虾,小龙虾,海米,河虾,青虾,明虾,草虾,白虾米,斑节对虾,白刺虾,长毛对虾,虾籽,小河虾,东方对虾,南美虾,虾虎,樱花虾,青龙虾,南极磷虾', 'xialei'),
(7, '螃蟹,蟹肉,大闸蟹,海蟹,肉蟹,梭子蟹,膏蟹,河蟹,青蟹,帝王蟹,锯缘青蟹,石蟹,霸王蟹,大花蟹,红鲟,和乐蟹,三点蟹,面包蟹', 'xielei'),
(8, '蛤蜊,牡蛎,鲍鱼,扇贝,香螺,干贝,海螺,瑶柱,海虹,黄蚬子,蚬子肉,毛蚶,螺蛳,鲜鲍,蛏子,海瓜子,鲜贝,螺肉,田螺,生蚝,花蛤,海蚌,青口贝,红螺,贻贝,河蚬,河蚌,赤贝,石螺,孔雀蛤,兰花蚌,蚌壳,香海螺,象拔蚌,南美螺,西施舌,秋蛤蜊,淡菜,杂色蛤蜊,带子,凤螺,海蜊子,黄螺,鸟贝,圆蛤', 'beilei'),
(9, '鱿鱼,章鱼,海蜇,海参,海带,紫菜,花胶,甲鱼,裙带菜,海蜇头,海胆,牛蛙,干鱿鱼,干墨鱼,干海带,鱼杂,蜇皮,鳄鱼肉,琼脂鱿鱼,须发菜,海兔,海苔,鱿鱼板,鱿鱼圈,软丝藻,甲鱼蛋,石花菜,水葫芦,鲨鱼骨,海带结,喇蛄,螺旋藻,苔菜,乌贼,墨鱼蛋,鱿鱼头,羊栖菜,鱼唇,鱼鳔,鱼卵,章鱼脚,真蛸,珍珠,鳆鱼,鲑鱼籽酱,地皮菜,水果藕,海草,裙边,葛仙米,笔管鱼,目鱼花', 'yuqita'),
(10, '白菜,油菜,芹菜,菠菜,蒜苗,圆白菜,小白菜,韭菜,生菜,茼蒿,香菜,豆苗,芦笋,苋菜,芥菜,绿豆芽,豆芽,荠菜,黄心菜,蕨菜,萝卜,缨芽菜,石花菜,橄榄菜,冬菜,马兰头,苦苣,大白菜,莴苣,叶紫,椰菜,娃娃菜,紫甘蓝,萝卜苗,紫橄榄菜,豌豆尖,乌塌菜,西芹,西生菜,艾草,紫包菜,蒜黄,白菜梗,芦蒿,苦菊,空心菜,韭黄,芥兰,上海青青,蒜,梅干菜,苤蓝,莴苣,芥蓝,黄豆芽,萝卜缨,莴笋叶,油麦菜,蒲公英,马齿菜,马齿苋,穿心莲,蒿子杆,青菜,西洋菜,芝麻菜,水芹菜,抱子甘蓝,菊花菜,观音菜,紫背天葵,儿菜,紫叶生菜,茴香,红菜苔,芦荟,苦细叶生菜,刺老芽,马郁兰,车前草,芦荟,荷叶,鞭笋,苦苣菜,苦参,苦竹叶,山苏巴西利紫钱,露葵,仙草,甜菜叶,乌龙茶,木耳菜,麦瓶草,苜蓿,牛蒡叶,奶白菜,瓢儿白,蒲菜,蒲公草,青江菜,野荞,七叶胆,清明菜,青蓼,球茎茴香,羊尾笋,芹菜叶,豆腐柴,月桂叶,豆瓣菜,冬寒菜,地肤,大玻璃草叶,分葱,桂竹笋,过猫,冰草,酸模,香葱,酸菜,菜薹', 'jingyelei'),
(11, '土豆,红薯,芋头,洋葱,胡萝卜,白萝卜,竹笋,莴笋,魔芋,山药,茭白,藕,雪里蕻,牛蒡,榨菜,荸荠,人参,折耳根,地瓜,莲藕,萝卜,水萝卜,铁棍山药,红萝卜,蒜薹,冬笋,紫甘薯,沙葛,笋尖,心里美萝卜,紫菜头,罗汉笋,黑豆芽,木薯,青萝卜,干笋,鱼腥草,紫苏,贡菜,樱桃,萝卜,心里美,首乌,春笋,藕带,香芋,川贝,鸡骨,草蕨,麻槟榔,芋笋,白姜薯,辣根,慈姑,通草,甜菜根,芜菁,大薯,黑土豆,苜蓿芽,仙人掌,襄荷,小水萝卜,魔芋丝,牛尾笋,婆罗门参,荞头,野蒜,郁金,豆薯,洋姜,大甲芋头,甘薯,葛根,红心萝卜,红菜头,红葱头,白芦笋,薤白,块根芹,甜菜,荔浦芋,雷笋,沙窝萝卜,手指胡萝卜,水果苤蓝,紫洋葱,紫苤蓝,脆山药,大芋头,小芋头,蒟蒻,淮山,萝卜干', 'genjinglei'),
(12, '豆角,茄子,青椒,西红柿,豌豆,荷兰豆,豇豆,扁豆,菜椒,四季豆,节瓜,秋葵,毛豆,蚕豆,板栗,花菜,瓠子,紫茄子,生瓜,南瓜子,五彩椒,辣椒,日本南瓜,长茄子,干豌豆,杭椒,豌豆尖,榆钱,油豆角,刀豆,柿子椒,茄瓜,四棱豆,朝天椒,龙牙豆,甜豆,歪头菜,墨西哥辣椒,仙人掌果,小扁豆,小豆蔻,小黄瓜,木豆,秋黄瓜,茄冬叶,白茄子,灯笼椒,黑柿蕃茄,红番茄,黄秋葵,金童玉女瓜,大蒜,树番茄,香蕉西葫芦,夜开花,小西红柿,紫长茄,线茄,绿长茄,绿圆茄,花茄子,紫圆茄,尖椒,紫尖椒,红色尖椒,朝天椒,荷兰瓜,小冬瓜,蒲瓜,棱角丝瓜,贝贝南瓜,金桔瓜,窝瓜,飞碟西葫芦,架豆,甜玉米,黏玉米,线椒,美人椒,番茄,圆茄子,二荆条,梅豆角', 'guoshilei'),
(13, '黄瓜,冬瓜,苦瓜,南瓜,丝瓜,佛手,西葫芦,佛手瓜,瓠瓜,葫芦,海底椰,金丝瓜,金瓜,白瓜,菜瓜,蜜蛇瓜,冬南瓜,南瓜,藤喷瓜,越瓜,飞碟瓜,葫子,白玉苦瓜,南瓜花,吊瓜', 'guacailei'),
(14, '菜花,西兰花,黄花菜,百合,香椿,菊花,玫瑰花,桂花,莼菜,菜心,韭菜花,,槐花,金银花,茉莉花,洋甘菊,剑花,桔梗,韭苔,芭蕉叶,白沙蒿,碱蓬,积雪草,白花桔梗,白花菜,白凤菜,山菜,水田芹,白菜薹,康乃馨,碧玉笋,芭蕉花,桑叶,罗勒,败酱草,食用大黄,苏子叶,包心菜,柳兰,白花椰菜,刺儿菜,漏芦,兰花,洛神花,莲蕉,乌菜,豌豆苗,独行菜,小葱,梅花,香蜂草,香蒲,雪菜,雪里红,油菜薹,油菜花,青金针花,野韭菜,野葱,鸭舌头,砖茶,珍珠花菜,紫萼香茶菜,大巢菜,黑油菜,塔菜,有机菜花,宝塔菜花,紫菜花,甘蓝,梨山甘蓝,快菜,绿叶生菜,紫叶生菜,散叶生菜,球生菜,奶油生菜,蒿子秆,大叶茼蒿,小叶茼蒿,香芹,盖菜,鸡毛菜,京水菜,乌塌菜,叶菾菜,紫叶油菜,红叶苋菜,绿叶苋菜,养心菜,面条菜,红秋葵,丝瓜尖,红薯叶,南瓜叶', 'hunhelei'),
(15, '蘑菇,草菇,香菇,平菇,金针菇,口蘑,黑木耳,姬菇,银耳,猴头菇,竹荪,白灵菇,白玉菇,金钱菇,榛蘑,灵芝,木耳,滑子菇,蟹味菇,杏鲍菇,竹笙,元蘑,慈菇,红蘑,鸡腿菇,花菇,冬菇,干茶树菇,干松茸,茶树菇,干香菇,牛肝菌,海鲜菇,双孢菇,鸡枞,石耳,羊肚菌,干巴菌,鸡土从,北风菌,白牛肝菌,双孢蘑菇,松蘑,鲍鱼菇,珊瑚菇,草菇心,柳松菇,舞菇,血红菇,地衣,小草菇,大红菇,秀珍菇,青头菌,珍珠菇,黄蘑,鸿喜菇,黑菌,灰树花,荷仙菇,荔枝菌,姬松茸,虫草花,袖珍菇,榆黄菇,松茸', 'junlei'),
(16, '苹果,香蕉,柠檬,菠萝,草莓,山楂,梨,杏,李子,猕猴桃,柚子,芒果,柿子,荔枝,石榴,葡萄,樱桃,西瓜,木瓜,圣女果,枣,火龙果,椰子,无花果,沙梨,牛油果,罗汉果,橘子,青木瓜,牛油果,果酱,桔子,橙子,杨梅,黄桃,桃,蔓越莓,榴莲,黑加仑,金桔树,莓,百香果,蓝莓酱,甘蔗,草莓酱,百香果,酸枣,哈密瓜,桑葚,香瓜,杨桃,蓝莓,西梅,苹果酱,甘蔗汁,山楂酱,黄桃酱,巨峰葡萄,布朗,菠萝蜜子,菠萝蜜,人心果,锦丰梨,人参果,白兰瓜,白金瓜,金塔寺瓜,橘皮,久保桃,京白梨,金丝小枣,白粉桃,芭蕉,芭乐,库尔勒梨,山竹,水蜜桃,神秘果,李子杏,沙果,沙棘,蛇果,释迦,北蕉,槟榔,莲雾,绿橙,醋栗,刺梨,长把梨,芦柑,莱阳梨,酪梨,李林蕉,甜瓜,提子,马奶子葡萄,木梨,磨盘柿,玫瑰蕉,倭锦苹果,西番莲,西贡蕉,祝光苹果,香椽,面包果,密云小枣,小米蕉,明月梨,青梅,马蹄黄梨,小西瓜,玛瑙石榴,蜜桔,玫瑰香葡萄,梅子,女贞子,奶柿子,枇杷,葡萄柚,蒲桃,苹果梨,雪花梨,红富士苹果,青芒果,庆丰桃,血橙,西洋梨,秋里蒙苹果,印度苹果,椰子肉,椰汁,椰枣,青苹果,鸭广梨,鸭梨,油皮,余柑子,芝麻蕉,早桔,大枣,冬枣,冬果梨,蛋黄果,伏苹果,粉蕉,凤眼果,福橘,国光苹果,红香蕉,黄河蜜瓜,红玉苹果,红提,黄皮果,红果,黑橄榄,山莓,海葡萄,蛇莓,柠檬汁,仙人掌果,西瓜皮,车厘子,红啤梨,西柚,龙眼,乌梅,苹果醋,沙棘汁,奇异果,凤梨', 'xianguolei'),
(17, '栗子,花生,腰果,白果,松子,核桃,芝麻,杏仁,莲子,枸杞,桂圆,麦芽,酸枣仁,黑芝麻,葡萄干,瓜子仁,榛子,紫薯,菱角,花生酱,柠檬片,开心果,小胡桃,山楂,干红枣,话梅,黑枣,果脯,蔓越莓,柏子仁,山核桃,桃仁,毛核桃,西瓜子,香榧,橡实,美国大杏仁,糜（糜子）,白芝麻,蜜枣,杏仁片,巴旦木', 'ganguolei'),
(18, '大米,糯米,黑米,小麦,小米,荞麦米,玉米,西米,薏米,燕麦,高粱,芡实,糙米,米线,紫米,红米,黄米,粳米,泰国香米,寿司米,血糯米,大麦,高粱,米籼,米荞,麦香米,米饭,米粉,粟米,江米,丝苗米,山兰米,长米,长糯米,皂角米,胚芽米,蓬莱米,青稞,芡实米,稻米,越光米,野米,岩米,阴米,鸡头米,菰米,红曲米,红薏米', 'milei'),
(19, '白面,粘米粉,荞麦面粉,藕粉,玉米面,挂面,糯米粉,面条,意面,油面筋,黑糯米,莜麦面,红薯粉,黄豆面,荞麦面,高筋面粉,中筋面粉,低筋面粉,小米面,全麦面粉,意大利面,油条,印度飞饼,蛋挞皮,饺子皮,馄饨皮,黄米面,粟粉,苏打粉,贝壳面,通心粉,乌龙面,小麦粉,藜麦,面线,米苔目,麦仁,米形面,南瓜粉,澄粉,富强粉,高粱面,裹粉,黑麦粉,乌冬面,油酥,饺子粉', 'mianlei'),
(20, '黑豆,小豆,红豆,绿豆,青豆,黄豆,红腰豆,白豆,白扁豆,赤小豆,马牙大豆,小圆豆,旭松纳豆,白芸豆,大豆,鹰嘴豆,绿豆,沙蜜豆', 'doulei'),
(21, '百叶结,嫩豆腐,内酯豆腐,米豆腐,烤麸,日本豆腐,豆渣,腐竹,熏干,芸豆,豆干,香干,山药豆,油豆腐,豆皮,豆腐干,红芸豆,豆腐,冻豆腐,素鸡,南豆腐,北豆腐,油豆皮,千张,豆浆,豆泡,豆腐脑,百页,白豆沙,板豆腐,千页豆腐,豆粕,豆腐皮,豆沙,豆筋,绢豆腐', 'douzhipin'),
(22, '淡奶油,奶油,奶酪,巧克力,起司,酸奶,牛奶,黄油,鲜奶油,芝士,植物奶油,动物奶油,炼乳,奶粉,白巧克力,乳酪,脱脂奶粉,马乳,牛初乳,全脂牛奶,羊奶,芝士粉,巧克力豆,马苏里拉芝士,全脂奶粉', 'rulei'),
(23, '面包,吐司,玉米片,燕麦片,咖啡,甜酒', 'fabian'),
(24, '宽粉,粉皮,粉丝,河粉,粉条,蕨根粉,年糕,玉米糁,河粉（干）,杏仁粉,椰子粉,葛根粉', 'miqita'),
(25, '香草粉,郁金香粉,绿茶粉,内酯,鸡尾酒', 'miqita1'),
(26, '红薯淀粉,八角,白醋,白胡椒,白酱油,陈醋,葱油,粗盐,醋,醋精,芥末酱,豆瓣,豆瓣酱,豆瓣辣酱,豆豉,番茄酱,番茄沙司,番茄辣酱,番茄汁,蜂蜜,腐乳(白),腐乳(红),腐乳(臭),花椒,菜籽油,胡麻油,羊油,胡椒粉,调和油,丁香,核桃油,大麻油,苦豆子,椰子油,茴香籽,棕榈油,芥茉,山茶油,葡萄籽油,干花椒叶,油茶籽油,可可粉,葵花籽油,抹茶粉,亚麻籽油,香草,杏仁油,咖啡粉,稻米油,芝麻酱,肉桂粉,香菇酱,迷迭香,黄豆酱,千岛酱,白砂糖,玉米淀粉,红糖,沙拉酱,冰糖,绵白糖,柠檬草,糖粉,黑胡椒酱,细砂糖,牛肉酱,糖浆,辣椒酱,蔗糖,薄荷,意粉酱,甜面酱,意面酱,珍珠糖,黄糖,麻油,香油,芝麻油,鱼露,蚝油,花椒油,辣椒油,花生油,豆油,茶油,牛油,玉米油,色拉油,蒜蓉酱,橄榄油,虾酱,巧克力酱,薰衣草,橄榄酱,酱油,醪糟,精盐,湖盐,味精,鸡精,干黄酱,肉桂,干姜,松针茶,水晶糖,食用色素,速溶酵母,山椒粉,水麦芽,葵花油,生粉,生抽,白油,板绞油,山葵,煲仔酱,白胡椒粉,蚕豆淀粉,草豆蔻,草果,葱烤酱,剁椒,铁观音,塔塔粉,糖霜,木鱼精,米醋,棉籽油,面豉,乌醋,五香粉,淀粉,黑蒜,香叶,梅肉酱,玛琪琳,小苏打,泡打粉,雪利酒,鱼油,青花椒,大葱,野菊,鸭油,亚麻仁,栀子花,植物油,竹炭粉,麦芽糖,香草精,QQ糖,小麦淀粉,枫糖浆,咖喱,桂皮,咖喱粉,桂皮粉,高良姜,桂花蜜,桂枝,果冻粉,果糖,黑胡椒,黑麻油,海胆酱,黑糖,胡椒面,红咖喱酱,红曲,黑芥,鲜姜,法香,菊苣,生姜,盐,料酒,老抽,干辣椒,葱,海盐,孜然,食用油,小米椒,香醋,泡椒,蒸鱼豉油,棉花糖,十三香,白酒,辣椒粉,吉利丁,可乐,椒盐,面包糠,木薯淀粉,姜粉,红酒,小茴香,红曲粉,蛋黄酱,橙皮,花椒粉,转化糖浆,枧水,果醋,椰蓉,布丁粉,黄酒,鸡汁,砂仁,花雕酒,郫县豆瓣酱,甜酒曲,鲍鱼汁,老干妈,沙茶酱,糖桂花,麻椒,测试食材,油泼辣子,寿司醋,高汤,味啉,披萨酱,泰椒', 'diaoweilei'),
(27, '燕窝,阿胶,雪蛤,蚕蛹,茯苓,党参,当归,蜂王浆,百合干,马鞭草,咖啡豆,甘草,苦丁,绿茶,红茶,普洱,艾蒿,肉豆蔻,鸡血,败酱,决明子,白芷,白玉草,鼠尾草,蔘须,珊瑚草,南板蓝叶,巴戟天,白参,白附子,菖蒲,天麻,龙井,莱菔子,轮叶党参,太子参,土三七,木榧,杜仲,木香,木莲,木姜子,牛膝,牛至,南沙参,牛眼睛菌,南芎,牛黄,破布子,爬景天,青葙子,雪莲,益母草,青竹,掐不齐,淡竹叶,丹参,鸭跖草,紫苏子,珍珠梅,淡豆豉,丁香花,冬虫夏草,东风菜,莪术,谷芽,龟板,狗尾草,黄芪,板蓝根,绿苏,三叶香,番杏,桃胶,啤酒,黑枸杞,茶叶,酵母粉,白茅根,龟苓膏', 'yaoshilei');

#评论信息表
CREATE TABLE comment_msg(
mid INT PRIMARY KEY AUTO_INCREMENT,
menuid VARCHAR(8),
msg VARCHAR(300),
uptime BIGINT,
user_id INT
);
#回复评论信息表
CREATE TABLE replymsg(
rid INT PRIMARY KEY AUTO_INCREMENT,
menu_id INT,  #菜单id
user_id INT,  #用户id
m_id INT,     #评论信息编号
reply VARCHAR(300), #回复信息内容
replytime BIGINT
);








